Revit 2027 API
StructuralSectionConcretePolygon.PolygonDefinition Property
 Indicates whether the polygon contour is inscribed or circumscribed.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public StructuralSectionPolygonDefinition PolygonDefinition { get; set; }
Public Property PolygonDefinition As StructuralSectionPolygonDefinition
	Get
	Set
public:
property StructuralSectionPolygonDefinition PolygonDefinition {
	StructuralSectionPolygonDefinition get ();
	void set (StructuralSectionPolygonDefinition value);
}
member PolygonDefinition : StructuralSectionPolygonDefinition with get, set
Property Value
StructuralSectionPolygonDefinition
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
StructuralSectionConcretePolygon Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace